app/controllers/page_controller.rb

UPDATE "users" SET "bf_api_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["bf_api_token", "6AoBJuUAcxKpcABJObWHrKeYJ"], ["updated_at", "2020-02-21 22:19:58.974595"], ["id", 1]]
---
  def regenerate_token
    current_user.generate_token
    current_user.save